#######################################################
#
# Parametrs of SNN
#
#########################################################

# Spikes:
T = 0.05 #временной период
la = 20.0 #частота

# Neural Network
I = 4#4#нейроны на входе
H = 20#10#нероны на скрытом слое
O = 1# нейроны выходного слоя
ny = 0.000005#0.0000000001#0.000005 #скорость обучения
delta_t = 0.0001# шаг
N = int(T//delta_t)
L = 16#10
#Neuron SRM
# threshold = 0.1
# tR = 0.001 # мин рассстояние между 2 спайками
# tau = 0.005#константа функции эпсилон
# tauR = 0.05# константа функции эта
# P_rest = 0.
# P_threshold = 0.01
threshold = 0.5#0.2#0.1
tR = 0.001 # мин рассстояние между 2 спайками
tau = 0.005#константа функции эпсилон
tauR = 0.05# константа функции эта
P_rest = 0.
P_threshold = 0.5 #0.1 #0.1